In [1]:
import numpy as np
import pandas as pd

In [2]:
my_df = pd.DataFrame(np.random.randn(4,5), [1,2,3,4], ['red', 'orange', 'yellow', 'green', 'blue'])

In [3]:
my_df

        red    orange    yellow     green      blue
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498
3 -0.008274  1.656825 -0.278375  0.652643  0.726481
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401

In [4]:
my_df['orange']

1    0.636155
2   -0.073166
3    1.656825
4   -0.563387
Name: orange, dtype: float64

In [5]:
my_df['red']

1    0.051090
2   -1.250504
3   -0.008274
4   -2.726784
Name: red, dtype: float64

In [6]:
type(my_df['red'])

pandas.core.series.Series

In [7]:
type(my_df)

pandas.core.frame.DataFrame

In [8]:
my_df[['yellow', 'blue']]

     yellow      blue
1 -0.736145 -1.297012
2 -0.011279 -0.115498
3 -0.278375  0.726481
4 -0.200577  1.083401

In [9]:
type(my_df[['yellow', 'blue']])

pandas.core.frame.DataFrame

In [10]:
my_df['indigo'] = my_df['blue']

In [11]:
my_df

        red    orange    yellow     green      blue    indigo
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -1.297012
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498
3 -0.008274  1.656825 -0.278375  0.652643  0.726481  0.726481
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  1.083401

In [12]:
my_df['violet'] = my_df['blue'] + my_df['indigo']

In [13]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498 -0.230996
3 -0.008274  1.656825 -0.278375  0.652643  0.726481  0.726481  1.452962
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  1.083401  2.166802

In [14]:
my_df.loc[2]

red      -1.250504
orange   -0.073166
yellow   -0.011279
green    -1.089314
blue     -0.115498
indigo   -0.115498
violet   -0.230996
Name: 2, dtype: float64

In [15]:
my_df.iloc[1]

red      -1.250504
orange   -0.073166
yellow   -0.011279
green    -1.089314
blue     -0.115498
indigo   -0.115498
violet   -0.230996
Name: 2, dtype: float64

In [16]:
my_df.iloc[2] = my_df.iloc[1]

In [17]:
my_df.iloc[2]

red      -1.250504
orange   -0.073166
yellow   -0.011279
green    -1.089314
blue     -0.115498
indigo   -0.115498
violet   -0.230996
Name: 3, dtype: float64

In [18]:
my_df.loc[2, 'orange']

-0.07316591936454624

In [19]:
my_df.loc[[1,3], ['blue', 'violet']]

       blue    violet
1 -1.297012 -2.594023
3 -0.115498 -0.230996

In [20]:
my_df.drop(3)

        red    orange    yellow     green      blue    indigo    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498 -0.230996
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  1.083401  2.166802

In [21]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498 -0.230996
3 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498 -0.230996
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  1.083401  2.166802

In [22]:
my_df.drop(3, inplace=True)

In [23]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498 -0.230996
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  1.083401  2.166802

In [24]:
my_df.drop('indigo', axis=1)

        red    orange    yellow     green      blue    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.230996
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  2.166802

In [25]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.115498 -0.230996
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  1.083401  2.166802

In [26]:
my_df.drop('indigo', axis=1, inplace=True)

In [27]:
my_df

        red    orange    yellow     green      blue    violet
1  0.051090  0.636155 -0.736145 -0.839959 -1.297012 -2.594023
2 -1.250504 -0.073166 -0.011279 -1.089314 -0.115498 -0.230996
4 -2.726784 -0.563387 -0.200577 -1.518488  1.083401  2.166802

In [28]:
my_df.shape

(3, 6)